#include <windows.h> // Для роботи з кодуванням на Windows
#include "Student.h"
#include "Group.h"

int main()
{
    /*
        static_cast - повертає об'єкт із тими самими даними але із зміненим типом (double -> float);

        За замовчуванням:
    Створює об'єкт без аргументів.
    Використовується без вказівки початкових значень.
З параметрами:
    Приймає аргументи під час створення об'єкта.
    Дозволяє ініціалізувати об'єкт конкретними значеннями.
Копіювання:
    Створює копію наявного об'єкта.
    Використовується для передачі об'єкта або створення копії.

        Геттери (Getter Methods):
Що це:
    Геттери - це методи, які використовуються для набуття значення приватної змінної об'єкта.
Навіщо потрібні:
    Забезпечують безпечний доступ до приватних даних об'єкта.
    Дозволяють контролювати доступ до даних, що покращує безпеку та спрощує супровід коду.

Сетери (Setter Methods):
Що це:
    Сетери - це методи, що використовуються для встановлення значення приватної змінної об'єкта.
Навіщо потрібні:
    Забезпечують контрольований доступ до приватних даних об'єкта.
    Дозволяють встановити правила та обмеження для встановлення значень, наприклад, перевіряти коректність даних, що вводяться.
    */

    SetConsoleCP(1251); // Встановлюємо кодування консолі для введення
    SetConsoleOutputCP(1251); // Встановлюємо кодування консолі для виводу

    Group grpOfStudents;
    grpOfStudents.readStudentsFromFile("output.txt");

    grpOfStudents.showStudents();
    grpOfStudents.showUnsatisfactoryStudents();

    ofstream file("output.txt");
    if (file.is_open()) {
        file << grpOfStudents; // Використовуємо перевантажений оператор <<
        file.close();
        cout << "Дані успішно записані у файл 'output.txt'." << endl;
    }
    else {
        cout << "Помилка відкриття файлу для запису." << endl;
    }
}